tutorials/functionally-graded/constant/thermoPath
(
10000.0000    1.0000
10100.0000    0.0000
)
