tutorials/functionally-graded/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// - Alloy "A" properties
solid
{
    kappa   (5.0  0.0   0.0);
    Cp      (800.0 0.0       0.0);
}

// - Liquid properties are ignored for graded material-type simulations
// - IMPORTANT!: Must set thermoPath melting temperature very high, e.g., 10000 K
//   to avoid any liquid phase transition in the simulation (AdditiveFOAM will reset
//   alpha = 0 anywhere that goes above the melting temperature)
liquid
{
    kappa   (4.889    0.014743  0.0);
    Cp      (750.65   0.0       0.0);
}

// - Alloy "B" properties
powder
{
    kappa   (25.0  0.0   0.0);
    Cp      (600.0 0.0       0.0);
}

//- fluid flow properties
rho     [1 -3 0 0 0 0 0]    7569.92;
mu      [1 -1 -1  0 0 0 0]  0.003032;
beta    [0 0 0 -1 0 0 0]    1.2e-4;
DAS     [0 1 0 0 0 0 0]     10e-6;
Lf      [0  2 -2  0 0 0 0]  2.1754e5;

// ************************************************************************* //
