tutorials/functionally-graded/system/ExaCA
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

ExaCA
{
    type ExaCA;
    libs ("libExaCAFunctionObject.so");
    
    box         (0 -0.0001 -0.0002) (0.002 0.0001 0);
    dx          2.5e-6;
    isoValue    1620;
}

// *********************************************************************** //
